tap "dhth/tap"
tap "homebrew/bundle"
tap "jeffreywildman/virt-manager"
tap "mistertea/et"
tap "mklement0/ttab", "https://github.com/mklement0/ttab.git"
tap "prbinu/touch2sudo"
tap "rogeriopradoj/cask-peazip"
brew "autodiff"
brew "autossh"
brew "bat"
brew "bat-extras"
brew "bottom"
brew "broot"
brew "cflow"
brew "codequery"
brew "difftastic"
brew "diskus"
brew "doxygen"
brew "dua-cli"
brew "dust"
brew "erdtree"
brew "fastfetch"
brew "fd"
brew "fish"
brew "fortune"
brew "fuc"
brew "node"
brew "fzf"
brew "gdu"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gitui"
brew "glow"
brew "gping"
brew "icu4c@76"
brew "graphviz"
brew "htop"
brew "iproute2mac"
brew "jc"
brew "jless"
brew "jq"
brew "lazygit"
brew "lsd"
brew "macvim"
brew "mas"
brew "mdp"
brew "mtr"
brew "ndiff"
brew "neovim"
brew "nushell"
brew "onefetch"
brew "pkgconf"
brew "procs"
brew "riff"
brew "ripgrep"
brew "ripgrep-all"
brew "spaceman-diff"
brew "sshpass"
brew "stow"
brew "superfile"
brew "tealdeer"
brew "wireshark", link: false
brew "termshark"
brew "tkdiff"
brew "tmux"
brew "tokei"
brew "universal-ctags"
brew "uutils-diffutils"
brew "uv"
brew "wdiff"
brew "wget"
brew "yazi"
brew "zoxide"
brew "mistertea/et/et"
brew "mklement0/ttab/ttab"
brew "prbinu/touch2sudo/touch2sudo"
cask "adobe-acrobat-reader"
cask "aldente"
cask "alt-tab"
cask "appflowy"
cask "betterdisplay"
cask "cheatsheet"
cask "claude"
cask "dockdoor"
cask "docker"
cask "firefox"
cask "ghostty"
cask "google-drive"
cask "joplin"
cask "keepassxc"
cask "klogg"
cask "lastpass"
cask "latest"
cask "lm-studio"
cask "logseq"
cask "mac-mouse-fix"
cask "marta"
cask "notunes"
cask "osxfuse"
cask "peazip"
cask "podman-desktop"
cask "pycharm-ce"
cask "raycast"
cask "spaceman"
cask "swift-quit"
cask "termius"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "whatsapp"
cask "whisky"
cask "wireshark"
cask "zed"
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Command X", id: 6448461551
mas "DirEqual", id: 1435575700
mas "Hidden Bar", id: 1452453066
mas "LastPass", id: 926036361
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft To Do", id: 1274495053
mas "Microsoft Word", id: 462054704
mas "Slack", id: 803453959
mas "WhatsApp", id: 310633997
mas "Windows App", id: 1295203466
vscode "abdalmoniem-alhifnawy.c-call-hierarchy"
vscode "alefragnani.bookmarks"
vscode "arpinfidel.chartographer"
vscode "asciidoctor.asciidoctor-vscode"
vscode "bierner.markdown-mermaid"
vscode "catppuccin.catppuccin-vsc"
vscode "chanhx.crabviz"
vscode "charliermarsh.ruff"
vscode "coolchyni.beyond-debug"
vscode "daelonsuzuka.nicegui"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "gitworktrees.git-worktrees"
vscode "gruntfuggly.todo-tree"
vscode "ibm.output-colorizer"
vscode "letmaik.git-tree-compare"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "luozhihao.call-graph"
vscode "mads-hartmann.bash-ide-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-speech"
vscode "philstainer.git-worktree"
vscode "redhat.vscode-yaml"
vscode "robocorp.robotframework-lsp"
vscode "ryu1kn.text-marker"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tomrijndorp.find-it-faster"
vscode "typefox.yang-vscode"
vscode "vscode-icons-team.vscode-icons"
vscode "zainchen.json"
