brew "autossh"
brew "bat"
brew "bat-extras"
brew "bottom"
brew "broot"
brew "dust"
brew "fd"
brew "fzf"
brew "gdu"
brew "gh"
brew "git-delta"
brew "gitui"
brew "gping"
brew "htop"
brew "jc"
brew "jq"
brew "jless"
brew "lazygit"
brew "lsd"
brew "neovim"
brew "onefetch"
brew "procs"
brew "ripgrep"
brew "tealdeer"
brew "tokei"
brew "yazi"
brew "zoxide"